loadtest/results/direct-ab-instance-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9001

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   12.233 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1719000 bytes
HTML transferred:       1404000 bytes
Requests per second:    245.23 [#/sec] (mean)
Time per request:       244.665 [ms] (mean)
Time per request:       4.078 [ms] (mean, across all concurrent requests)
Transfer rate:          137.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       5
Processing:     1  239 320.6     92    2073
Waiting:        1  234 320.2     85    2073
Total:          1  240 320.6     93    2073

Percentage of the requests served within a certain time (ms)
  50%     93
  66%    203
  75%    340
  80%    429
  90%    704
  95%    919
  98%   1318
  99%   1437
 100%   2073 (longest request)