loadtest/results/direct-ab-instance-2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9002

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   11.693 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1719000 bytes
HTML transferred:       1404000 bytes
Requests per second:    256.57 [#/sec] (mean)
Time per request:       233.852 [ms] (mean)
Time per request:       3.898 [ms] (mean, across all concurrent requests)
Transfer rate:          143.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     2  229 231.6    143    1744
Waiting:        1  222 230.4    136    1744
Total:          2  229 231.6    143    1746

Percentage of the requests served within a certain time (ms)
  50%    143
  66%    251
  75%    326
  80%    398
  90%    560
  95%    718
  98%    887
  99%    961
 100%   1746 (longest request)