loadtest/results/direct-ab-instance-5.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9005

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   11.544 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1719000 bytes
HTML transferred:       1404000 bytes
Requests per second:    259.87 [#/sec] (mean)
Time per request:       230.888 [ms] (mean)
Time per request:       3.848 [ms] (mean, across all concurrent requests)
Transfer rate:          145.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     4  227 224.1    141    1386
Waiting:        3  220 223.9    130    1386
Total:          4  227 224.1    141    1386

Percentage of the requests served within a certain time (ms)
  50%    141
  66%    259
  75%    326
  80%    387
  90%    556
  95%    675
  98%    844
  99%    978
 100%   1386 (longest request)