loadtest/results/pgbouncer-ab-final-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1500 requests
Completed 3000 requests
Completed 4500 requests
Completed 6000 requests
Completed 7500 requests
Completed 9000 requests
Completed 10500 requests
Completed 12000 requests
Completed 13500 requests
Completed 15000 requests
Finished 15000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9101

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   23.505 seconds
Complete requests:      15000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      8595000 bytes
HTML transferred:       7020000 bytes
Requests per second:    638.16 [#/sec] (mean)
Time per request:       94.020 [ms] (mean)
Time per request:       1.567 [ms] (mean, across all concurrent requests)
Transfer rate:          357.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     4   94  82.7     66     713
Waiting:        3   91  82.9     63     712
Total:          4   94  82.7     66     713

Percentage of the requests served within a certain time (ms)
  50%     66
  66%     93
  75%    117
  80%    136
  90%    195
  95%    254
  98%    355
  99%    420
 100%    713 (longest request)