loadtest/results/pgbouncer-ab-final-2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1500 requests
Completed 3000 requests
Completed 4500 requests
Completed 6000 requests
Completed 7500 requests
Completed 9000 requests
Completed 10500 requests
Completed 12000 requests
Completed 13500 requests
Completed 15000 requests
Finished 15000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9102

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   21.765 seconds
Complete requests:      15000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      8595000 bytes
HTML transferred:       7020000 bytes
Requests per second:    689.17 [#/sec] (mean)
Time per request:       87.062 [ms] (mean)
Time per request:       1.451 [ms] (mean, across all concurrent requests)
Transfer rate:          385.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       8
Processing:     4   87  68.3     64     590
Waiting:        3   84  69.2     61     590
Total:          4   87  68.3     64     590

Percentage of the requests served within a certain time (ms)
  50%     64
  66%     89
  75%    109
  80%    126
  90%    171
  95%    223
  98%    293
  99%    359
 100%    590 (longest request)